{
  "image_url": "https://lirp.cdn-website.com/78412f62/dms3rep/multi/opt/Logo_White-gold-key_Gold-Key-1920w.png",
  "tags": [
    "Real Estate",
    "Market Report",
    "Statistics",
    "Housing",
    "MLS"
  ],
  "address": "400 Broadhollow Road, Suite 5, Farmingdale, New York 11735",
  "id": "onekey-mls-2025-03-18",
  "title": "Home Prices Climb as Sales Decline: February Market Remains Competitive",
  "description": "OneKey® MLS, the premier real estate marketplace providing monthly statistics for residential transactions from Montauk to Manhattan and through the Hudson Valley to the Catskill Mountains, reported data for February 2025 reflecting a competitive market that continues to favor sellers. In February, the regional single-family closed median sale price was $710,000, marking a 9.2% year-over-year increase from $650,000 reported in February 2025. Condominiums reported a closed median sale price of $530,400, reflecting a 12.9% increase from the same price reported a year ago. The closed median sale price for co-ops was $295,000, a 1.7% increase from $290,000 in February 2024. In terms of transactional activity, closed sales for single-family homes, condominiums and co-op sales were down compared to last year. There was a total of 2,117 single-family closed transactions in February 2024, which is 3.8% less than February 2024. Condominium closed sales were 385 and co-op sales were 419, marking 13.3% and 23.3% declines respectively. Richard Haggerty, CEO of OneKey® MLS, commented on the current market conditions, stating, \"The real estate market continues to see rising prices, with single-family home prices up 9.2% year-over-year. However, closed sales have declined by 3.8%, and inventory remains lower by 8.8%, which has kept competition high. While the market presents challenges for buyers, those who are well-prepared can still find opportunities.\" OneKey MLS, the largest MLS in New York, aggregates the real estate transactional data from the counties making up the regional MLS service area, and reports individually on each county therein. For more detailed regional and county-based statistics about residential, condo, and co-op sales transactions, please visit marketstats.onekeymls.com",
  "price": "N/A",
  "category": "Real Estate",
  "availability": "Available",
  "author": "Tricia Chirco",
  "date": "March 18, 2025",
  "name": "OneKey® MLS",
  "phone": "631-670-0710 x405",
  "email": "tchirco@onekeymls.com"
}