{
  "image_url": "https://lirp.cdn-website.com/78412f62/dms3rep/multi/opt/Logo_White-gold-key_Gold-Key-1920w.png",
  "tags": [
    "Real Estate",
    "Market Report",
    "Housing",
    "MLS"
  ],
  "address": "400 Broadhollow Road, Suite 5, Farmingdale, New York 11735; 300 Sunrise Highway, West Babylon, New York 11704; 1 Maple Ave, White Plains, New York 10605",
  "id": "onekey-mls-report-2025",
  "title": "OneKey® MLS Report Highlights Shifts in Closed Sales Amid Ongoing Inventory Constraints in New York Regional Housing Market",
  "description": "OneKey® MLS, the largest MLS in New York, has released its latest regional housing market report, showing a slight dip in closed sales activity while inventory challenges continue to shape conditions across the New York metro area. In June, median sales prices continued their upward trend for all property types — which include single-family homes, condominiums, and co-ops — rising 6.1% year-over-year to $700,000. The median sales price for single-family homes climbed to $775,000, marking a 6.2% gain. Condominiums saw a 5.1% increase to a median of $515,000, while co-op prices rose 7.0% to reach a median of $300,000. Meanwhile, closed sales for all properties edged down 6.0% year-over-year to 3,972 transactions, with single-family home closings down 4.6% to 2,981, condo closings down 12.9% to 501, and co-op closings easing 6.7% to 490 units. Inventory remained tight across the region, with the total number of homes for sale declining 5.0% compared to June 2024, leaving 15,582 active listings. The month’s supply of inventory dipped slightly to 3.9 months, underscoring the competitive environment for buyers. New listings posted a modest year-over-year decrease of 1.5%, totaling 6,439 for the month. “While buyer interest remains strong, the market continues to be defined by limited inventory and affordability pressures,” said Richard Haggerty, CEO of OneKey® MLS. “As we move through the remainder of the year, we expect steady demand and gradual price growth to persist as supply continues to lag behind.”",
  "price": "N/A",
  "category": "Real Estate",
  "availability": "Available",
  "author": "Tricia Chirco",
  "date": "July 15, 2025",
  "name": "OneKey® MLS",
  "phone": "N/A",
  "email": "N/A"
}